In [1]:
#판다스 라이브러리 임포트
import pandas as pd

# Series 생성

In [2]:
s1 = pd.Series([10, 20, 30, 40, 50])
s1

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [3]:
s1.index

RangeIndex(start=0, stop=5, step=1)

In [4]:
s1.values

array([10, 20, 30, 40, 50], dtype=int64)

In [5]:
s2 = pd.Series(['a', 'b', 'c', 1, 2, 3])

In [6]:
import numpy as np

In [7]:
index_1 = ['A', 'B', 'C', 'D']
s4 = pd.Series([200, 195, np.nan, 205], index = index_1)
s4

A    200.0
B    195.0
C      NaN
D    205.0
dtype: float64

In [8]:
index_date = ['2019-4-18', '2019-4-19', '2019-4-20', '2019-4-21']
s4 = pd.Series([200, 195, np.nan, 205], index = index_date)
s4

2019-4-18    200.0
2019-4-19    195.0
2019-4-20      NaN
2019-4-21    205.0
dtype: float64

In [9]:
s5 = pd.Series({'국어' : 100, '영어' : 95, '수학' : 90})
s5

국어    100
영어     95
수학     90
dtype: int64

In [10]:
Quiz = pd.Series({'California' : np.nan, 'Ohio' : 35000, 'Texas' : 71000, 'Oregon' : 16000, 'Utah' : 5000})
Quiz

California        NaN
Ohio          35000.0
Texas         71000.0
Oregon        16000.0
Utah           5000.0
dtype: float64

In [11]:
import pandas as pd
obj = pd.Series({'Ohio' : 35000, 'Texas' : 71000, 'Oregon' : 16000, 'Utah' : 5000})
obj

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

# DataFrame 생성

In [12]:
pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]])

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [13]:
data_list = np.array([[10,20,30],[40,50,60],[70,80,90]])
data_list

array([[10, 20, 30],
       [40, 50, 60],
       [70, 80, 90]])

In [14]:
pd.DataFrame(data_list)

    0   1   2
0  10  20  30
1  40  50  60
2  70  80  90

In [15]:
data = np.array([[1,2,3],[4,5,6],[7,8,9],[10,11,12]])
index_date = pd.date_range('2019-09-01', periods=4)
columns_list = ['A', 'B', 'C']
pd.DataFrame(data, index = index_date, columns = columns_list)

             A   B   C
2019-09-01   1   2   3
2019-09-02   4   5   6
2019-09-03   7   8   9
2019-09-04  10  11  12

In [16]:
table_data = {'연도' : [2015, 2016, 2016, 2017, 2017],
             '지사' : ['한국','한국','미국','한국','미국'],
              '고객 수' : [200, 250, 450, 300, 500]
             }
pd.DataFrame(table_data)

     연도  지사  고객 수
0  2015  한국   200
1  2016  한국   250
2  2016  미국   450
3  2017  한국   300
4  2017  미국   500

In [17]:
df = pd.DataFrame(table_data, columns = ['지사', '연도', '고객 수'])
df

   지사    연도  고객 수
0  한국  2015   200
1  한국  2016   250
2  미국  2016   450
3  한국  2017   300
4  미국  2017   500

In [18]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [19]:
df.columns

Index(['지사', '연도', '고객 수'], dtype='object')

In [20]:
df.values

array([['한국', 2015, 200],
       ['한국', 2016, 250],
       ['미국', 2016, 450],
       ['한국', 2017, 300],
       ['미국', 2017, 500]], dtype=object)

In [21]:
index_date = pd.date_range('2019-09-01', periods=6)

In [22]:
# np.random.rand(a,b) : 0과 1사이의 난수를 a x b의 2차원 배열로 생성
Quiz_df = pd.DataFrame(np.random.rand(6,4), index = index_date, columns = list('ABCD'))
Quiz_df

                   A         B         C         D
2019-09-01  0.061751  0.671089  0.142657  0.502646
2019-09-02  0.471725  0.123895  0.979878  0.232288
2019-09-03  0.571245  0.150903  0.653952  0.485941
2019-09-04  0.365221  0.676683  0.035766  0.718859
2019-09-05  0.545001  0.440874  0.845636  0.087954
2019-09-06  0.336088  0.627047  0.103722  0.763863

In [23]:
df_index = ['one', 'two', 'three', 'four', 'five']
df_columns = ['year', 'state', 'pop']
Quiz_dic = {'year' : [2000, 2001, 2002, 2001, 2002],
          'state' : ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
           'pop' : [1.5,1.7,3.6,2.4,2.9]
          }
Quiz_dic

{'year': [2000, 2001, 2002, 2001, 2002],
 'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}

In [24]:
from pandas import Series, DataFrame
# import를 직접적으로 해주면 pd.DataFrame가 아닌 DataFrame만 해주어도 됌

frame = DataFrame(Quiz_dic, index = df_index,columns=df_columns)
frame

       year   state  pop
one    2000    Ohio  1.5
two    2001    Ohio  1.7
three  2002    Ohio  3.6
four   2001  Nevada  2.4
five   2002  Nevada  2.9

In [25]:
# DataFrame_data.mean([axis = 0 or 1])
# 평균 axis = 0 열 방향, axisme_data.std([axis = 0 or 1])
# 표준편차 axis = 0 열 방향, axisme_data.std([axis = 0 or 1])
# DataFrame_data.head([n])
# 처음 n개의 행 데이터 반환 (위에서 부터)
# DataFrame_data.tail
# 마지막 n개의 행 데이터 반환 (밑에서 부터)
# DataFrame_data.[a : b] 
# a부터 b까지의 연속된 구간의 행 데이터 선택
# DataFrame_data.loc['index_name']
# index 항목 이름을 찾아 그에 해당되는 행 선택
# DataFrame_data['column_name']
# column 항목 이름을 찾아 그에 해당되는 행 선택 ※컬럼은 loc 메소드가 필요없다.
# DataFrame_data.T
# 데이터프레임의 행과 열을 전치시는 메소드

# Series 데이터 연산

In [26]:
s1 = pd.Series([1,2,3,4,5])
s2 = pd.Series([10,20,30,40,50])
s2 + s1

0    11
1    22
2    33
3    44
4    55
dtype: int64

In [27]:
s2 - s1

0     9
1    18
2    27
3    36
4    45
dtype: int64

In [28]:
s2 * s1

0     10
1     40
2     90
3    160
4    250
dtype: int64

In [29]:
s2 / s1

0    10.0
1    10.0
2    10.0
3    10.0
4    10.0
dtype: float64

# 데이터 프레임 연산

In [30]:
table_data3 = {'봄': [200.1, 200.2, 200.3, 200.4, 200.5], 
               '여름': [700.1, 700.2, 700.3, 700.4, 700.5],
               '가을': [300.1, 300.2, 300.3, 300.4, 300.5], 
               '겨울': [100.1, 100.2, 100.3, 100.4, 100.5]}
index_list = ['2012', '2013', '2014', '2015', '2016']
df3 = pd.DataFrame(table_data3, index = index_list)
df3

          봄     여름     가을     겨울
2012  200.1  700.1  300.1  100.1
2013  200.2  700.2  300.2  100.2
2014  200.3  700.3  300.3  100.3
2015  200.4  700.4  300.4  100.4
2016  200.5  700.5  300.5  100.5

In [31]:
pd.DataFrame(df3.mean(), columns=['계절별 평균'])

    계절별 평균
봄    200.3
여름   700.3
가을   300.3
겨울   100.3

In [32]:
pd.DataFrame(df3.std(axis=1), columns=['년도별 표준편차'])

        년도별 표준편차
2012  262.995564
2013  262.995564
2014  262.995564
2015  262.995564
2016  262.995564

In [33]:
KTX_index = [2011, 2012, 2013, 2014, 2015, 2016, 2017]
KTX_columns = ['경부선 KTX', '호남선 KTX', '경전선 KTX', '전라선 KTX', '동해선 KTX'] 
KTX_data = {'경부선 KTX' : [30000, 30000, 40000, 40000, 40000, 40000, 30000],
                       '호남선 KTX' : [7000, 6000, 6000, 6000, 8000, 10000, 9000],
                       '경전선 KTX' : [3000, 4000, 4000, 4000, 4000, 4000, 5000],
                       '전라선 KTX' : [300, 1000, 1000, 2000, 3000, 3000, 5000],
                       '동해선 KTX' : [np.nan, np.nan, np.nan, np.nan, 2000, 3000, 6000]}
KTX_df = pd.DataFrame(KTX_data, index = KTX_index, columns = KTX_columns)
KTX_df

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2011    30000     7000     3000      300      NaN
2012    30000     6000     4000     1000      NaN
2013    40000     6000     4000     1000      NaN
2014    40000     6000     4000     2000      NaN
2015    40000     8000     4000     3000   2000.0
2016    40000    10000     4000     3000   3000.0
2017    30000     9000     5000     5000   6000.0

In [34]:
KTX_df.head()

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2011    30000     7000     3000      300      NaN
2012    30000     6000     4000     1000      NaN
2013    40000     6000     4000     1000      NaN
2014    40000     6000     4000     2000      NaN
2015    40000     8000     4000     3000   2000.0

In [35]:
KTX_df.tail()

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2013    40000     6000     4000     1000      NaN
2014    40000     6000     4000     2000      NaN
2015    40000     8000     4000     3000   2000.0
2016    40000    10000     4000     3000   3000.0
2017    30000     9000     5000     5000   6000.0

In [36]:
KTX_df[1:2]
# 앞에서 부터 뒤에 숫자 빼기 1을 한 수만큼이므로 여기서는 KTX_df[1] 하나 뿐이다.

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2012    30000     6000     4000     1000      NaN

In [37]:
KTX_df[2:5]

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2013    40000     6000     4000     1000      NaN
2014    40000     6000     4000     2000      NaN
2015    40000     8000     4000     3000   2000.0

In [38]:
KTX_df['전라선 KTX']

2011     300
2012    1000
2013    1000
2014    2000
2015    3000
2016    3000
2017    5000
Name: 전라선 KTX, dtype: int64

In [39]:
KTX_df.loc[2011]

경부선 KTX    30000.0
호남선 KTX     7000.0
경전선 KTX     3000.0
전라선 KTX      300.0
동해선 KTX        NaN
Name: 2011, dtype: float64

In [40]:
KTX_df.loc[2013:2015]

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2013    40000     6000     4000     1000      NaN
2014    40000     6000     4000     2000      NaN
2015    40000     8000     4000     3000   2000.0

# 데이터 통합하기

In [41]:
df1 = pd.DataFrame({'Class1': [95, 92, 98, 100],
                    'Class2': [91, 93, 97, 99]})
df1

   Class1  Class2
0      95      91
1      92      93
2      98      97
3     100      99

In [42]:
df2 = pd.DataFrame({'Class1': [87, 89],'Class2': [85, 90]})
df2

   Class1  Class2
0      87      85
1      89      90

In [43]:
df1.append(df2)

   Class1  Class2
0      95      91
1      92      93
2      98      97
3     100      99
0      87      85
1      89      90

In [44]:
df1.append(df2, ignore_index=True)

   Class1  Class2
0      95      91
1      92      93
2      98      97
3     100      99
4      87      85
5      89      90

In [45]:
df4 = pd.DataFrame({'Class3': [93, 91, 95, 98]})
df4

   Class3
0      93
1      91
2      95
3      98

In [46]:
# Index 레이블이 같으면 join()을 이용하여 데이터 추가가능
df1.join(df4)

   Class1  Class2  Class3
0      95      91      93
1      92      93      91
2      98      97      95
3     100      99      98

# 데이터 파일 저장하고 가져오기

In [47]:
%%writefile C:/Users/elris/Basic_AI_Data/sea_rain1.csv
연도,동해,남해,서해,전체
1996,15,16,17,18
1997,13,14,15,16
1998,17,16,15,14
1999,18,18,17,17

Writing C:/Users/elris/Basic_AI_Data/sea_rain1.csv

In [48]:
import pandas as pd
sea = pd.read_csv('C:/Users/elris/Basic_AI_Data/sea_rain1.csv')
sea

     연도  동해  남해  서해  전체
0  1996  15  16  17  18
1  1997  13  14  15  16
2  1998  17  16  15  14
3  1999  18  18  17  17

In [49]:
sea = pd.read_csv('C:/Users/elris/Basic_AI_Data/sea_rain1.csv', index_col="연도")
sea

      동해  남해  서해  전체
연도
1996  15  16  17  18
1997  13  14  15  16
1998  17  16  15  14
1999  18  18  17  17

In [50]:
pd.read_csv('C:/Users/elris/Basic_AI_Data/sea_rain1.csv',index_col="연도", encoding = "Utf-8")

      동해  남해  서해  전체
연도
1996  15  16  17  18
1997  13  14  15  16
1998  17  16  15  14
1999  18  18  17  17

In [51]:
df_body = pd.DataFrame({'Weight' : [62, 67, 55, 74],
                         'Height' : [165, 177, 180, 172]},
                          index = ['ID_1', 'ID_2', 'ID_3', 'ID_4'])
df_body.index.name = 'User'
df_body

      Weight  Height
User
ID_1      62     165
ID_2      67     177
ID_3      55     180
ID_4      74     172

In [52]:
bmi = df_body['Weight']/((df_body['Height']/100)**2)

In [53]:
df_body['BMI'] = bmi
df_body

      Weight  Height        BMI
User
ID_1      62     165  22.773186
ID_2      67     177  21.385936
ID_3      55     180  16.975309
ID_4      74     172  25.013521

In [54]:
df_body.to_csv('C:/Users/elris/Basic_AI_Data/df_body.csv', encoding = 'Utf-8')

In [55]:
#읽어오기와 저장하기
#파일을 읽어오는 경우 pd.read_확장자명(파일명, 추가옵션)
#파일을 저장하는 경우 pd.to_확장자명(파일명, 추가옵션)

# 엑셀파일 다루기

In [62]:
df = pd.read_excel('C:/Users/elris/Basic_AI_Data/학생시험성적.xlsx', sheet_name = '기말')
df

    학생   국어  영어   수학     평균
0  홍길동   85  85  100  90.00
1  이순신   70  95   85  86.33
2  유관순  100  75   80  85.00
3  안중근   95  90   95  93.33
4  박숭실  100  85   90  91.66

In [64]:
df = pd.read_excel('C:/Users/elris/Basic_AI_Data/학생시험성적.xlsx', sheet_name = 1, index_col = 0)
# index_col = 0 대신에 '학생'이라 써도 같은 결과
df

      국어  영어   수학     평균
학생
홍길동   85  85  100  90.00
이순신   70  95   85  86.33
유관순  100  75   80  85.00
안중근   95  90   95  93.33
박숭실  100  85   90  91.66

In [65]:
df1 = {'학생': ['A', 'B', 'C', 'D', 'E', 'F'], '국어': [80, 90, 95, 70, 75, 85], '영어': [90, 95, 70, 85, 90, 95], '수학': [85, 95, 75, 80, 85, 100]}
df2 = pd.DataFrame(df1)
df2

  학생  국어  영어   수학
0  A  80  90   85
1  B  90  95   95
2  C  95  70   75
3  D  70  85   80
4  E  75  90   85
5  F  85  95  100

In [66]:
e_writer = pd.ExcelWriter('C:/Users/elris/Basic_AI_Data/학생시험성적2.xlsx', engine='xlsxwriter')
df2.to_excel(e_writer, index=False)
e_writer.save()

In [67]:
e_writer2 = pd.ExcelWriter('C:/Users/elris/Basic_AI_Data/학생시험성적3.xlsx', engine='xlsxwriter')
df2.to_excel(e_writer2, index=False, sheet_name='중간')
df2.to_excel(e_writer2, index=False, sheet_name='기말')
e_writer2.save()

In [70]:
excel_files = ['C:/Users/elris/Basic_AI_Data/Andy_사원.xlsx', 'C:/Users/elris/Basic_AI_Data/Becky_사원.xlsx', 'C:/Users/elris/Basic_AI_Data/Chris_사원.xlsx']
total_data = pd.DataFrame()
excel_files

['C:/Users/elris/Basic_AI_Data/Andy_사원.xlsx',
 'C:/Users/elris/Basic_AI_Data/Becky_사원.xlsx',
 'C:/Users/elris/Basic_AI_Data/Chris_사원.xlsx']

In [71]:
for i in excel_files : 
    df = pd.read_excel(i)
    total_data = total_data.append(df, ignore_index = True)
total_data

   제품명    담당자   지역  1분기  2분기  3분기  4분기
0   시계   Andy  동작구  198  123  120  137
1   구두   Andy  동작구  273  241  296  217
2  핸드백   Andy  동작구  385  316  355  331
3   시계  Becky  강남구  154  108  155  114
4   구두  Becky  강남구  200  223  213  202
5  핸드백  Becky  강남구  350  340  377  392
6   시계  Chris  종로구  168  102  149  174
7   구두  Chris  종로구  231  279  277  292
8  핸드백  Chris  종로구  365  383  308  323

In [78]:
import glob
#glob는 지정 폴더 안의 파일들의 목록을 뽑을 때 사용, 파일의 경로명을 이용해서 선별가능
excel_files2 = glob.glob('C:/Users/elris/Basic_AI_Data/*사원.xlsx')
#이름에 사원이 들어가고 확장자가 xlsx인 파일들을 모두 불러와라
# * : 모든 문자열을 의미, ? : 한 글자로 된 모든 문자열을 의미
#*.*로 불러오면 모든 파일명과 확장자를 불러와달라는 의미
total_data2 = pd.DataFrame()
excel_files2

['C:/Users/elris/Basic_AI_Data\\Andy_사원.xlsx',
 'C:/Users/elris/Basic_AI_Data\\Becky_사원.xlsx',
 'C:/Users/elris/Basic_AI_Data\\Chris_사원.xlsx']

In [79]:
for i in excel_files2 :
    df = pd.read_excel(i)
    total_data2 = total_data2.append(df, ignore_index=True)
total_data2

   제품명    담당자   지역  1분기  2분기  3분기  4분기
0   시계   Andy  동작구  198  123  120  137
1   구두   Andy  동작구  273  241  296  217
2  핸드백   Andy  동작구  385  316  355  331
3   시계  Becky  강남구  154  108  155  114
4   구두  Becky  강남구  200  223  213  202
5  핸드백  Becky  강남구  350  340  377  392
6   시계  Chris  종로구  168  102  149  174
7   구두  Chris  종로구  231  279  277  292
8  핸드백  Chris  종로구  365  383  308  323

In [80]:
f_name = 'C:/Users/elris/Basic_AI_Data/판매량_통합.xlsx'
# 데이터를 처리하기 쉽게 한 곳으로 통합
total_writer = pd.ExcelWriter(f_name, engine='xlsxwriter')
total_data2.to_excel(total_writer, index=False, sheet_name='통합')
total_writer.save()

In [81]:
df = pd.read_excel('C:/Users/elris/Basic_AI_Data/판매량_통합.xlsx')
handbag = df[(df['제품명']== '핸드백')] 
# 판매량_통합.xlsx 파일로 부터 제품명이 ‘핸드백’인 데이터만 가져오기
handbag

   제품명    담당자   지역  1분기  2분기  3분기  4분기
2  핸드백   Andy  동작구  385  316  355  331
5  핸드백  Becky  강남구  350  340  377  392
8  핸드백  Chris  종로구  365  383  308  323

In [82]:
handbag_sum = pd.DataFrame(handbag.sum(axis=1), columns = ['연간판매량'])
# 행끼리 더해주어야하므로 axis=1
handbag_sum

   연간판매량
2   1387
5   1459
8   1379

In [83]:
handbag_total = handbag.join(handbag_sum) 
# 연간판매량을 가로 통합하기
handbag_total

   제품명    담당자   지역  1분기  2분기  3분기  4분기  연간판매량
2  핸드백   Andy  동작구  385  316  355  331   1387
5  핸드백  Becky  강남구  350  340  377  392   1459
8  핸드백  Chris  종로구  365  383  308  323   1379

In [84]:
handbag_sum2 = pd.DataFrame(handbag_total.sum(), columns=['합계']) 
# axis = 0은 기본값으로 생략 가능
handbag_sum2

                   합계
제품명         핸드백핸드백핸드백
담당자    AndyBeckyChris
지역          동작구강남구종로구
1분기              1100
2분기              1039
3분기              1040
4분기              1046
연간판매량            4225

In [85]:
handbag_sum2.T
# 전치메소드

          제품명             담당자         지역   1분기   2분기   3분기   4분기 연간판매량
합계  핸드백핸드백핸드백  AndyBeckyChris  동작구강남구종로구  1100  1039  1040  1046  4225

In [86]:
handbag_total2 = handbag_total.append(handbag_sum2.T)
handbag_total2

          제품명             담당자         지역   1분기   2분기   3분기   4분기 연간판매량
2         핸드백            Andy        동작구   385   316   355   331  1387
5         핸드백           Becky        강남구   350   340   377   392  1459
8         핸드백           Chris        종로구   365   383   308   323  1379
합계  핸드백핸드백핸드백  AndyBeckyChris  동작구강남구종로구  1100  1039  1040  1046  4225

In [87]:
handbag_total2.loc['합계', '제품명'] = '핸드백'
handbag_total2.loc['합계', '담당자'] = '전체'
handbag_total2.loc['합계', '지역'] = '전체'
handbag_total2

    제품명    담당자   지역   1분기   2분기   3분기   4분기 연간판매량
2   핸드백   Andy  동작구   385   316   355   331  1387
5   핸드백  Becky  강남구   350   340   377   392  1459
8   핸드백  Chris  종로구   365   383   308   323  1379
합계  핸드백     전체   전체  1100  1039  1040  1046  4225

In [88]:
handbag_total.sort_values(by='연간판매량', ascending=True)
# 오름차순 정렬
# handbag_total.sort_values(by='연간판매량', ascending=False)
# 내림차순 정렬

   제품명    담당자   지역  1분기  2분기  3분기  4분기  연간판매량
8  핸드백  Chris  종로구  365  383  308  323   1379
2  핸드백   Andy  동작구  385  316  355  331   1387
5  핸드백  Becky  강남구  350  340  377  392   1459